FactoryBot.define do

  factory :kifu do
    user_id { 1 }
    player1 { "" }
    player2 { "" }
    win { 2 }
    content {"棋戦：
              戦型：
              開始日時：
              終了日時：
              手合割：平手
              先手：Player1
              後手：Player2
              手数----指手---------消費時間--
               1 ７六歩(77)        ( 0:01/00:00:01)
               2 ８四歩(83)        ( 0:02/00:00:02)
               3 ２六歩(27)        ( 0:01/00:00:02)
               4 ８五歩(84)        ( 0:01/00:00:03)
               5 ２五歩(26)        ( 0:01/00:00:03)
               6 ３二金(41)        ( 0:01/00:00:04)
               7 ７七角(88)        ( 0:01/00:00:04)
               8 ３四歩(33)        ( 0:01/00:00:05)
               9 ７八銀(79)        ( 0:01/00:00:05)
               10 ７七角成(22)       ( 0:01/00:00:06)
               まで10手で後手の勝ち"
                }
  end
end